In [2]:
import pandas as pd

In [40]:
# new data set
data = {
    "ID": [1, 2, 3, 4, 5, 6, 7, 8],
    "Name": ["Alice", "Bob", "CHARLIE", "Dana", "", "Frank", "Grace", "Henry"],
    "Age": [29, None, 35, 28, 22, "thirty", 27, 40],
    "Email": [
        "alice@example.com",
        "bob_at_example.com",
        "charlie@example",
        "dana@example.com",
        "emily@example.com",
        "frank@example.com",
        "grace@example.com",
        None
    ],
    "Join_Date": [
        "2021-03-15",
        "2020/12/01",
        "March 5, 2019",
        "2019-07-21",
        "2022-01-10",
        "2021-11-30",
        "15-08-2020",
        "2018-06-01"
    ],
    "Salary": [55000, 48000, 62000, None, 50000, 58000, 51000, 70000]
}

df = pd.DataFrame(data)
print(df)

   ID     Name     Age               Email      Join_Date   Salary
0   1    Alice      29   alice@example.com     2021-03-15  55000.0
1   2      Bob    None  bob_at_example.com     2020/12/01  48000.0
2   3  CHARLIE      35     charlie@example  March 5, 2019  62000.0
3   4     Dana      28    dana@example.com     2019-07-21      NaN
4   5               22   emily@example.com     2022-01-10  50000.0
5   6    Frank  thirty   frank@example.com     2021-11-30  58000.0
6   7    Grace      27   grace@example.com     15-08-2020  51000.0
7   8    Henry      40                None     2018-06-01  70000.0

In [4]:
df.describe()

            ID        Salary
count  8.00000      7.000000
mean   4.50000  56285.714286
std    2.44949   7761.320457
min    1.00000  48000.000000
25%    2.75000  50500.000000
50%    4.50000  55000.000000
75%    6.25000  60000.000000
max    8.00000  70000.000000

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 8 entries, 0 to 7
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   ID         8 non-null      int64
 1   Name       8 non-null      object
 2   Age        7 non-null      object
 3   Email      7 non-null      object
 4   Join_Date  8 non-null      object
 5   Salary     7 non-null      float64
dtypes: float64(1), int64(1), object(4)
memory usage: 516.0+ bytes

In [6]:
df.isna().sum()

ID           0
Name         0
Age          1
Email        1
Join_Date    0
Salary       1
dtype: int64

In [77]:
# Fix name column
df = df.replace(r'^\s*$', pd.NA, regex=True)
df['Name'] = df['Name'].str.title()

In [78]:
df

   ID     Name   Age              Email  Join_Date   Salary
0   1    Alice  29.0  alice@example.com 2021-03-15  55000.0
1   2      Bob   NaN  bobat@example.com 2022-01-01  48000.0
2   3  Charlie  35.0    charlie@example 2022-01-01  62000.0
3   4     Dana  28.0   dana@example.com 2019-07-21      NaN
4   5     <NA>  22.0  emily@example.com 2022-01-10  50000.0
5   6    Frank  30.0  frank@example.com 2021-11-30  58000.0
6   7    Grace  27.0  grace@example.com 2022-01-01  51000.0
7   8    Henry  40.0               None 2018-06-01  70000.0

In [18]:
df.isna().sum()

ID           0
Name         1
Age          1
Email        1
Join_Date    0
Salary       1
dtype: int64

In [44]:
# fix age column
df['Age'] = df['Age'].replace('thirty',30)
df['Age'] = pd.to_numeric(df['Age'], errors='coerce')

In [46]:
df

   ID     Name   Age               Email      Join_Date   Salary
0   1    Alice  29.0   alice@example.com     2021-03-15  55000.0
1   2      Bob   NaN  bob_at_example.com     2020/12/01  48000.0
2   3  CHARLIE  35.0     charlie@example  March 5, 2019  62000.0
3   4     Dana  28.0    dana@example.com     2019-07-21      NaN
4   5     <NA>  22.0   emily@example.com     2022-01-10  50000.0
5   6    Frank  30.0   frank@example.com     2021-11-30  58000.0
6   7    Grace  27.0   grace@example.com     15-08-2020  51000.0
7   8    Henry  40.0                None     2018-06-01  70000.0

In [48]:
# common ways to fix email :
df['Email'] = df['Email'].str.strip().str.lower()
# Fixes things like:
# " John.DOE@Gmail.Com " → "john.doe@gmail.com"
# " USER@YAHOO.COM" → "user@yahoo.com"


# df['email'] = df['email'].str.replace(r'\s+', '', regex=True)
# Fixes things like:
# " john doe@ Gmail.Com " → "john.doe@gmail.com"


# 3. Remove trailing dots, commas, etc.
# Example: "john@gmail.com." → "john@gmail.com"
# df['email'] = df['email'].str.replace(r'[.,;:]+$', '', regex=True)


# 4. Fix common domain mistakes automatically
# common_fixes = {
#     "gmal.com": "gmail.com",
#     "gmaill.com": "gmail.com",
#     "yahho.com": "yahoo.com",
#     "hotnail.com": "hotmail.com",
#     "outlok.com": "outlook.com"
# }

# df['email'] = df['email'].replace(common_fixes, regex=True)

In [49]:
df

   ID     Name   Age               Email      Join_Date   Salary
0   1    Alice  29.0   alice@example.com     2021-03-15  55000.0
1   2      Bob   NaN  bob_at_example.com     2020/12/01  48000.0
2   3  CHARLIE  35.0     charlie@example  March 5, 2019  62000.0
3   4     Dana  28.0    dana@example.com     2019-07-21      NaN
4   5     <NA>  22.0   emily@example.com     2022-01-10  50000.0
5   6    Frank  30.0   frank@example.com     2021-11-30  58000.0
6   7    Grace  27.0   grace@example.com     15-08-2020  51000.0
7   8    Henry  40.0                None     2018-06-01  70000.0

In [64]:
# fixing email :
df['Email'] = df['Email'].str.replace(r'\s+', '', regex= True)
df['Email'] = df['Email'].str.replace('_', '', regex= True) #  remove '_'

df['Email'] = df['Email'].str.replace(
    r'([^@]+)(example\.com)$', 
    r'\1@example.com',
    regex=True
)
df

   ID     Name   Age              Email      Join_Date   Salary
0   1    Alice  29.0  alice@example.com     2021-03-15  55000.0
1   2      Bob   NaN  bobat@example.com     2020/12/01  48000.0
2   3  CHARLIE  35.0    charlie@example  March 5, 2019  62000.0
3   4     Dana  28.0   dana@example.com     2019-07-21      NaN
4   5     <NA>  22.0  emily@example.com     2022-01-10  50000.0
5   6    Frank  30.0  frank@example.com     2021-11-30  58000.0
6   7    Grace  27.0  grace@example.com     15-08-2020  51000.0
7   8    Henry  40.0               None     2018-06-01  70000.0

In [69]:
# ways to fix dates :
# 1️.  Convert a column to datetime
# Pandas has a special datetime64[ns] type. Always convert your date column to datetime:
# import pandas as pd
# df['Date'] = pd.to_datetime(df['Date'], errors='coerce', dayfirst=False)


# 2. Check datetime column
# df['date'].dtype   # should be datetime64[ns]
# df['date'].head()


# 3 Extract parts of a date
# Once it’s datetime, you can extract year, month, day, weekday, etc.:
# df['year'] = df['date'].dt.year
# df['month'] = df['date'].dt.month
# df['day'] = df['date'].dt.day
# df['weekday'] = df['date'].dt.day_name()
# df['hour'] = df['date'].dt.hour


# 4 Filter rows by date
# # All rows after Jan 1, 2023
# df[df['date'] > '2023-01-01']
# # Between two dates
# df[(df['date'] >= '2023-01-01') & (df['date'] <= '2023-06-30')]

# 5️ Date arithmetic
# # Difference between two dates
# df['days_diff'] = (df['end_date'] - df['start_date']).dt.days
# # Add or subtract days
# df['date_plus_7'] = df['date'] + pd.Timedelta(days=7)


# 6️⃣ Handling missing or messy dates
# # Missing dates
# df['date'].isna().sum()
# # Fill missing dates with a default
# df['date'] = df['date'].fillna(pd.Timestamp('2023-01-01'))
# # Extract valid dates only
# df = df[df['date'].notna()]


# 7️⃣ Format dates back to string -> optional
# df['date_str'] = df['date'].dt.strftime("%d-%m-%Y")

In [79]:
df['Join_Date'] = pd.to_datetime(df['Join_Date'], errors='coerce', dayfirst=False)
df['Join_Date'].dtype 
df['Join_Date'].head()
df['Join_Date'] = df['Join_Date'].fillna(pd.Timestamp('2022-01-01'))
df

   ID     Name   Age              Email  Join_Date   Salary
0   1    Alice  29.0  alice@example.com 2021-03-15  55000.0
1   2      Bob   NaN  bobat@example.com 2022-01-01  48000.0
2   3  Charlie  35.0    charlie@example 2022-01-01  62000.0
3   4     Dana  28.0   dana@example.com 2019-07-21      NaN
4   5     <NA>  22.0  emily@example.com 2022-01-10  50000.0
5   6    Frank  30.0  frank@example.com 2021-11-30  58000.0
6   7    Grace  27.0  grace@example.com 2022-01-01  51000.0
7   8    Henry  40.0               None 2018-06-01  70000.0